tutorials/cases/LEIgasifierPrescribedUs/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    outlet
    {
        type            zeroGradient;
    }
    inlet
    {
        // No longer an air supply, so it imposes no temperature either.
        type            zeroGradient;
    }
    nozzle
    {
        // Ibrahim (2025): 1000 K air; 600 K was found insufficient. Not the
        // ignition source — that is the 1200 K char strip set at the throat
        // in system/setFieldsDict.
        type            fixedValue;
        value           uniform 1000;
    }
    wall
    {
        type            zeroGradient;
    }
    sides
    {
        type            empty;
    }
}


// ************************************************************************* //
