tutorials/cases/LEIgasifierPrescribedUs/0.orig/Us
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      Us;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

// Bed descent field, non-uniform: solved by utilities/solidUsPotential from
// constant/solidUsPotentialDict (mass-conservative through the Imbert throat
// and the per-zone reaction sinks). Do not hand-edit -- regenerate instead.
internalField   nonuniform List<vector>
460
(
(-6.1993739e-09 -0 -5.8681056e-05)
(-1.6121925e-08 -0 -5.8709452e-05)
(-1.9724237e-08 -0 -5.8754788e-05)
(-1.5803706e-08 -0 -5.8799458e-05)
(-6.0020203e-09 -0 -5.8826764e-05)
(6.0020203e-09 -0 -5.8826764e-05)
(1.5803706e-08 -0 -5.8799458e-05)
(1.9724237e-08 -0 -5.8754788e-05)
...
)
;

boundaryField
{
    outlet
    {
        type            zeroGradient;
    }
    inlet
    {
        type            zeroGradient;
    }
    wall
    {
        type            zeroGradient;
    }
    nozzle
    {
        type            zeroGradient;
    }
    sides
    {
        type            empty;
    }
}


// ************************************************************************* //
